<h1>#Relatório de análise IV</h1>
<h3>Seleções de Frequências</h3>

In [2]:
import pandas as pd

In [3]:
dados = pd.read_csv('aluguel_residencial.csv',sep=';')
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
5,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
6,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
7,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
8,Apartamento,Centro,1,0,0,36,1200.0,NaN,NaN
9,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0

#Selecione somente os imóveis classificados com tipo 'Apartamento'.

In [4]:
selecao = dados.Tipo=='Apartamento'
selecao
n1 = dados[selecao].shape[0]
n1

19532

#Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.

In [6]:
selecao = (dados.Tipo =='Casa') | (dados.Tipo=='Casa de Condomínio') | (dados.Tipo=='Casa de Vila')
selecao
n2 = dados[selecao]
n2

2212

#Selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.

In [10]:
selecao = (60<=dados['Area']) & (dados['Area']<=100)
n3 = dados[selecao].shape[0]
n3

8719

#Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00

In [13]:
selecao = (dados['Quartos']>=4)&(dados['Valor']<2000)
n4=dados[selecao].shape[0]
n4

41

In [16]:
print(f"""Nº de imóveis classificados com tipo 'Apartamento' ->{n1}

Nº de imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila' ->{n2}

Nº de imóveis com área entre 60 e 100 metros quadrados, incluindo os limites ->{n3}

Nº de imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00 ->{n4}""")

Nº de imóveis classificados com tipo 'Apartamento' ->19532

Nº de imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila' ->2212

Nº de imóveis com área entre 60 e 100 metros quadrados, incluindo os limites ->8719

Nº de imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00 ->41

In [3]:

import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [18]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [24]:
selecao = alunos['Aprovado']==True
alunos[selecao]

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [25]:
selecao = (alunos['Aprovado'])&(alunos['Sexo']=='F')
alunos[selecao]

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [26]:
selecao = ((alunos.Idade>=10)&(alunos.Idade<=20))|(alunos.Idade>=40)
alunos[selecao]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False

In [13]:
selecao=  alunos['Aprovado']==False
alunos[['Nome','Sexo','Idade']][selecao]
alunos.loc[selecao,['Nome','Sexo','Idade']]

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35